openfoam2206/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/LBend/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            basicTwoPhaseSystem;

phases          (solids gas);

solids
{
    type          purePhaseModel;

    diameterModel constant;

    constantCoeffs
    {
        d               462e-6;
    }

    residualAlpha   1e-5;
}

gas
{
    type          purePhaseModel;

    diameterModel constant;
    constantCoeffs
    {
        d               1;
    }
    residualAlpha   1e-5;
}

blending
{
    default
    {
        type            none;
        residualAlpha   1e-6;
        continuousPhase gas;
    }
}

surfaceTension
(
    (gas and solids)
    {
        type            constant;
        sigma           0;
    }
);

aspectRatio
(
);

drag
(
    (solids in gas)
    {
        type            GidaspowErgunWenYu;
        residualAlpha   1e-5;
        residualRe      1e-5;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
    (solids in gas)
    {
        type            constantCoefficient;
        Cvm             0;
    }
);

heatTransfer
(
    (solids in gas)
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }
);

lift
(
);

phaseTransfer
(
);

wallLubrication
(
);

turbulentDispersion
(
);

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
