openfoam2206/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/LBend/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingTwoPhaseEulerFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.9;

deltaT          1e-4;

writeControl    adjustable;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  9;

writeCompression on;

timeFormat      general;

timePrecision   8;

runTimeModifiable on;

adjustTimeStep  yes;

maxCo           0.1;

maxDeltaT       0.01;


// ************************************************************************* //
